import plotly.express as px
import pandas as pd

# 시간대별 자전거 교통사고 통계 데이터를 DataFrame으로 생성
data = {
    '시간대': ['00시~02시', '02시~04시', '04시~06시', '06시~08시', '08시~10시', '10시~12시', '12시~14시', '14시~16시', '16시~18시', '18시~20시', '20시~22시', '22시~24시'],
    '사고건수': [90, 42, 163, 567, 1022, 871, 836, 1033, 1301, 1066, 608, 278],
    '사망자수': [3, 0, 7, 6, 15, 13, 14, 14, 17, 9, 6, 1],
    '부상자수': [92, 44, 161, 579, 1052, 902, 855, 1078, 1332, 1110, 639, 298]
}
df = pd.DataFrame(data)

# 산점도 생성
fig = px.scatter(df, x="시간대", y="사고건수", size="사망자수", color="부상자수",
                 hover_name="시간대", log_x=False, size_max=60)
# HTML 파일로 저장
fig.write_html("ex10.html")
