import plotly.express as px
import pandas as pd


# 주어진 데이터
data = {
    '시도별': ['전국', '서울특별시', '부산광역시', '대구광역시', '인천광역시', '광주광역시', '대전광역시', '울산광역시', '세종특별자치시', '경기도', '강원특별자치도', '충청북도', '충청남도', '전라북도', '전라남도', '경상북도', '경상남도', '제주특별자치도'],
    '안전표시판': [87441, 30246, 2174, 2946, 2421, 850, 1821, 521, 1147, 19097, 2494, 2242, 4424, 2192, 2460, 5071, 5319, 2016],
    '자전거횡단도': [21619, 2583, 607, 982, 1216, 148, 806, 192, 649, 7133, 313, 2128, 1090, 486, 885, 875, 1369, 157]
}


df = pd.read_excel('./data/2022_자전거_안전시설_설치현황.xlsx')

df = pd.DataFrame(data)

# Sunburst Chart 그리기
fig = px.sunburst(df, path=['시도별', '안전표시판', '자전거횡단도'], values='안전표시판',
                  title='2022년 자전거 안전시설 설치 현황',
                  labels={'안전표시판': '안전표시판 수', '자전거횡단도': '자전거횡단도 수'})

# # 차트 보이기
# fig.show()

# HTML 파일로 저장
fig.write_html("SunburstChart_01.html")